Amostragem Aleatória Simples, com exemplos de: tamanho 4, tamanho 5 e proporção de 0.44

In [1]:
import pandas

In [2]:
populacao = [1,2,3,4,5,6,7,8,9,10,11,12]

In [3]:
df = pandas.DataFrame(populacao, columns = ["values_populacao"])
df # Output console

    values_populacao
0                  1
1                  2
2                  3
3                  4
4                  5
5                  6
6                  7
7                  8
8                  9
9                 10
10                11
11                12

In [4]:
df.sample(n = 4)

    values_populacao
0                  1
11                12
4                  5
6                  7

In [5]:
df.sample(n = 5)

    values_populacao
4                  5
11                12
5                  6
1                  2
9                 10

In [6]:
df.sample(frac = 0.44)

    values_populacao
4                  5
3                  4
8                  9
2                  3
10                11

Amostragem Sistemática, pegando a terceira ocorrência de uma população. Usando o python:

In [7]:
import numpy as np

In [8]:
lengthPopulacao = len(populacao)

In [9]:
lengthPopulacao # Output

12

In [10]:
for i in range(1, lengthPopulacao, 3):
    print(i)

1
4
7
10

In [11]:
amostra_python = []
for i in range(1, lengthPopulacao, 3):
    amostra_python.append(populacao[i])

In [12]:
amostra_python # Output

[2, 5, 8, 11]

No pandas, a lógica é amesma. Utilizo índices do pandas para filtrar somente as posições que queremos:

In [13]:
def amostragemSistematica(df, inicio = 0, step = 3):
    indexes = np.arange(inicio, df.shape[0], step = step) # do NumPy para criar uma sequência de índices que serão utilizados para selecionar as linhas do DataFrame de forma sistemática.
    amostra = df.iloc[indexes]
    return amostra

In [14]:
amostragemSistematica(df, 1, 3)

    values_populacao
1                  2
4                  5
7                  8
10                11

Exercício: Amostragem Aleatória Simples

Imagine que você está conduzindo uma pesquisa em uma escola para determinar a opinião dos alunos sobre a qualidade da merenda escolar. Você deseja realizar uma amostragem aleatória simples para selecionar 20 alunos dentre os 200 alunos da escola.

Crie um DataFrame chamado dados_escola contendo duas colunas: "Aluno" e "Opiniao". A coluna "Aluno" deve conter uma lista de strings com os nomes dos alunos (por exemplo, "Aluno 1", "Aluno 2", etc.), e a coluna "Opiniao" deve conter uma lista de valores inteiros (1 para opinião positiva e 0 para opinião negativa).

Escreva uma função chamada amostra_aleatoria_simples que receba o DataFrame dados_escola e o tamanho da amostra desejada (por exemplo, 20). A função deve retornar uma amostra aleatória simples contendo o número de alunos especificado.

Teste sua função usando o DataFrame dados_escola que você criou e imprima a amostra resultante.

In [15]:
import random 


nomes = ["João", "Maria", "Pedro", "Ana", "Lucas", "Laura", "Carlos", "Mariana", "Paulo", "Julia",
                   "Rafael", "Camila", "Diego", "Isabela", "Felipe", "Bianca", "Fernando", "Gabriela", "Henrique",
                   "Natália", "Arthur", "Sofia", "Luisa", "Vitor", "Manuela", "Gustavo", "Clara", "Matheus", "Helena",
                   "Rodrigo", "Larissa", "Luciano", "Luana", "Leonardo", "Amanda", "Ricardo", "Letícia", "Renato",
                   "Alice", "Cesar", "Valentina", "Marcelo", "Isadora", "Guilherme", "Mirella", "Daniel", "Eduarda",
                   "Roberto", "Carolina", "Hugo", "Beatriz", "Sergio", "Júlia", "Igor", "Lorena", "Vinicius", "Vivian",
                   "Marcela", "Fábio", "Tatiana", "Alex", "Mariane", "Samuel", "Larissa", "Raul", "Natasha", "Pedro",
                   "Laís", "Wagner", "Adriana", "Tiago", "Cintia", "Eduardo", "Patrícia", "Diego", "Fernanda", "Vagner",
                   "Priscila", "Felipe", "Aline", "Marcos", "Cristina", "Jorge", "Cecília", "Rafael", "Cássia", "Gabriel",
                   "Roberta", "Ramon", "Carla", "Thiago", "Talita", "Caio", "Juliana", "Cleiton", "Marina", "Renan",
                   "Lilian", "Bruno", "Caroline"]

In [16]:
opinioes = [random.choice([1, 0]) for _ in range(100)]

In [17]:
dadosEscola = pandas.DataFrame({"alunos": nomes, "opinioes": opinioes})
dadosEscola

      alunos  opinioes
0       João         0
1      Maria         1
2      Pedro         0
3        Ana         1
4      Lucas         1
..       ...       ...
95    Marina         0
96     Renan         1
97    Lilian         0
98     Bruno         1
99  Caroline         1

[100 rows x 2 columns]

In [18]:
dadosEscola.sample(n = 20).reset_index(drop=True)

       alunos  opinioes
0      Cássia         1
1     Gustavo         1
2     Beatriz         1
3    Gabriela         1
4       Tiago         0
5     Eduarda         0
6       Laura         0
7   Guilherme         1
8     Natália         1
9      Marina         0
10    Letícia         1
11      Alice         0
12     Carlos         0
13   Henrique         0
14      Luana         1
15   Cristina         1
16   Leonardo         0
17    Mariana         0
18       Caio         1
19     Felipe         1